[Warden X2SoldierClassTemplate]
+DisplayName="Warden"
+ClassSummary="Wardens are psionically gifted scouts. However they have not received a traditional training in psionics and the way they use it differ from what we've seen before. Instead of using a Psi-Amp to amplify their mind's power, they make their body act as a conduit for the dormant psionic energy around the battlefield, and they affect it in various ways as the energy passes through them."
+LeftAbilityTreeTitle="Ebb"
+RightAbilityTreeTitle="Flow"
+AbilityTreeTitles[0]="Ebb"
+AbilityTreeTitles[1]="Flow"
+AbilityTreeTitles[2]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Acheron"
+RandomNickNames[1]="Aether"
+RandomNickNames[2]="Arrakis"
+RandomNickNames[3]="Atreides"
+RandomNickNames[4]="Bosporus"
+RandomNickNames[5]="Caldera"
+RandomNickNames[6]="Devil's Current"
+RandomNickNames[7]="Elysian"
+RandomNickNames[8]="Equinox"
+RandomNickNames[9]="Fremen"
+RandomNickNames[10]="Moonspell"
+RandomNickNames[11]="Nova"
+RandomNickNames[12]="Pulsar"
+RandomNickNames[13]="Red River"
+RandomNickNames[14]="Redshift"
+RandomNickNames[15]="Rogue Wave"
+RandomNickNames[16]="Rubicon"
+RandomNickNames[17]="Shepherd"
+RandomNickNames[18]="Tigris"
+RandomNickNames[19]="Wildfire"
+RandomNickNames[20]="Yanartash"
;ALPHABETICAL ORDER
+RandomNickNames_Male[0]="Orion"
;ALPHABETICAL ORDER
+RandomNickNames_Female[0]="Artemis"
;ALPHABETICAL ORDER
+PhotoboothSoloBLines_Male[0]="His blade... THEIR BLOOD!"
+PhotoboothSoloBLines_Male[1]="A Storm is Coming."
+PhotoboothSoloBLines_Male[2]="His blade will bring JUSTICE!"
+PhotoboothSoloBLines_Male[3]="If He Is With Us, Who Can Stand Against Us?"
+PhotoboothSoloBLines_Male[4]="Blademaster. Death Dealer."
+PhotoboothSoloBLines_Male[5]="\"I do not fear the storm.  I am the storm.\""
+PhotoboothSoloBLines_Female[0]="Her blade... THEIR BLOOD!"
+PhotoboothSoloBLines_Female[1]="A Storm is Coming."
+PhotoboothSoloBLines_Female[2]="Her blade will bring JUSTICE!"
+PhotoboothSoloBLines_Female[3]="If She Is With Us, Who Can Stand Against Us?"
+PhotoboothSoloBLines_Female[4]="Blademaster. Death Dealer."
+PhotoboothSoloBLines_Female[5]="\"I do not fear the storm.  I am the storm.\""

[WardensAdvance X2AbilityTemplate]
+LocFriendlyName="Warden's Advance"
+LocLongDescription="Attack any enemy within movement range with your <Ability:SecondaryWeaponName/>. Activate Ebb and Flow and change Stance if you have an Action Point left."
+LocHelpText="Attack any enemy within movement range with your <Ability:SecondaryWeaponName/>. Activate Ebb and Flow and change Stance if you have an Action Point left."
+LocPromotionPopupText="<Bullet/> A Warden can perform a \"Dash\" move, using both actions to move, and still trigger a melee attack against an adjacent enemy without ending ones turn.<br/><Bullet/> The Warden will then activate Ebb and Flow and be able to move again.<br/><Bullet/> As Wardens progress through the ranks they will have access to a variety of different abilities for the remaining Action Points.<br/><Bullet/> This ability is available in both stances but can only be activated once per turn.<br/><Bullet/> Cannot be activated while disoriented.<br/>"

[WardenDecider X2AbilityTemplate]
+LocFriendlyName="Ebb and Flow"
+LocLongDescription="Wardens are able to change stances instead of ending their turn after certain abilities, provided they have an Action Point left."
+LocHelpText="Wardens are able to changes stance instead of ending their turn after certain abilities, provided they have an Action Point left."
+LocPromotionPopupText="<Bullet/> Wardens can harness psionic energy around them to change between Offensive and Defensive stances instead of ending their turn.<br/><Bullet/> Wardens always start their turn in Offensive Stance.<br/><Bullet/> Almost all ranged attacks are restricted to Offensive Stance, while Defensive Stance abilities allow the Warden to negate incoming damage or prepare for the next turn in various ways.<br/><Bullet/> \"Warden's Advance\" is the first ability which links both forms. Each activation of \"Warden's Advance\" will in turn activate \"Ebb and Flow\" provided the Warden has an Action Point left.<br/><Bullet/> Progressing through the ranks will provide the Warden with more options as to how and where Ebb and Flow activates.<br/><Bullet/> A high-ranking Warden can choose in which Stance to start an assault and in which Stance to end it.<br/>"
+LocFlyOverText="Ebb and Flow"

[WardenImmunityActivate X2AbilityTemplate]
+LocFriendlyName="Foresight"
+LocLongDescription="Foresight protects the Warden against the next damaging attack and removes damaging status effects on activation. Only available in Defensive Stance. Ends your turn. This ability cannot be activated on the same turn with Unwavering Concentration."
+LocHelpText="Defends against the next damaging attack."
+LocFlyOverText="Foresight"
+LocPromotionPopupText="<Bullet/> Foresight protects the Warden against the next damaging attack by creating a psi shield that has the same amount of health as the Warden's maximum health.<br/><Bullet/> If the Warden has gained Health bonuses via items the shield will be stronger.<br/><Bullet/> Defensive Stance only.<br/><Bullet/> Ends your turn.<br/><Bullet/> Removes Burning, Acid Burn, Poisoned and Bleeding on activation.<br/><Bullet/> Warden is rendered immune to Fire, Poison, Acid and Bleeding while the shield is active.<br/><Bullet/> Cannot be activated while disoriented.<br/><Bullet/> This ability cannot be activated on the same turn with \"Unwavering Concentration\".<br/><Bullet/> Warden cannot sustain the shield for long, it will only shield against the first incoming hit and then disappear.<br/><Bullet/> Foresight will not protect the Warden against special attacks which bypass shields. E.g. Viper's Bind<br/>"

[WardenDeception X2AbilityTemplate]
+LocFriendlyName="Deception"
+LocLongDescription="Subsequent shots during a turn provide +5% Hit Chance in addition to +20% Melee Critical and +10% Ranged Critical chance if against the same target."
+LocHelpText="Subsequent shots during a turn provide +5% Hit Chance in addition to +20% Melee Critical and +10% Ranged Critical chance if against the same target."
+LocFlyOverText="Deception"
+LocPromotionPopupText="<Bullet/> After a bullpup shot gain +5% Hit Chance in addition to +20% Melee Critical and +10% Ranged Critical chance against your initial target for that turn.<br/><Bullet/> The Warden's ability to accrue many actions per turn can result in massive bonuses from Deception.<br/><Bullet/> Combine this ability with the likes of Unwavering Concentration or Unbalance to gain massive advantages.<br/>"

[WardenConcentrationActivate X2AbilityTemplate]
+LocFriendlyName="Unwavering Concentration"
+LocLongDescription="Concentrate on your next move. Defensive Stance: +15% Hit and Critical Chance and +2 Damage for Critical hits for 2 turns. Offensive Stance: +10% Hit and Critical Chance and +1 Damage for Crits. Activates Ebb and Flow. Removes Disorientation. 1 turn cooldown. Refresh the initial effect's duration if its already active."
+LocHelpText="Grants up to +15% Hit and Critical Chance and +2 Damage for Crits."
+LocPromotionPopupText="<Bullet/> If activated in Defensive Stance it grants +15% Hit and Critical Chance and +2 Damage for Crits for all abilities for 2 turns.<br/><Bullet/> If activated in Offensive Stance it grants +10% Hit and Critical Chance and +1 Damage for Crits for all abilities for 2 turns.<br/><Bullet/> Available in both the Offensive and Defensive Stance.<br/><Bullet/> 1 turn cooldown.<br/><Bullet/> Removes Disoriented status effect on activation.<br/><Bullet/> Cannot be activated while burning.<br/><Bullet/> Activates Ebb and Flow if the Warden has an Action Point left.<br/><Bullet/> You can keep refreshing the initial effects duration. E.g. Activate in Defensive Stance to get 15% bonus Hit chance, next turn activate it in Offensive Stance to retain that 15% or vice versa. <br/>"
+LocFlyOverText="Unwavering Concentration"

[WardenBladeShredder X2AbilityTemplate]
+LocFriendlyName="Parting Strike"
+LocLongDescription="Sword attacks shred armor. They also get +10% Hit Chance and do +1 Damage."
+LocHelpText="Sword attacks shred armor. Warden is also more accurate and powerful with sword attacks."
+LocPromotionPopupText="<Bullet/> Melee attacks have +10% hit chance and do +1 Damage.<br/><Bullet/> A successful attack with a conventional sword will shred 1 armor from the target and do +1 Damage with +10% Hit Chance.<br/><Bullet/> More advanced swords will shred more armor from targets.<br/>"

[WardenMarauder X2AbilityTemplate]
+LocFriendlyName="Insight"
+LocLongDescription="Standard shots are not turn-ending, allowing for shooting then moving or shooting twice on a turn."
+LocHelpText="Standard shots are not turn-ending, allowing for shooting then moving or shooting twice on a turn."
+LocPromotionPopupText="<Bullet/> Insight provides more tactical options when planning the Warden's turn.<br/>"

[WardenBarrage X2AbilityTemplate]
+LocFriendlyName="Barrage"
+LocLongDescription="Ranged attacks against flanked enemies deal +1 damage. All attacks have a bonus 10% chance to critically hit enemies."
+LocHelpText="Ranged attacks against flanked enemies deal +1 damage. All attacks have a bonus 10% chance to critically hit enemies."
+LocFlyOverText="Barrage"

[WardenHalfSword X2AbilityTemplate]
+LocFriendlyName="Half-Sword"
+LocLongDescription="A guaranteed melee knockback attack which does 2-3 damage and disorients the target if activated in Defensive Stance. Activates Ebb and Flow. Can apply bonus weapon effects."
+LocHelpText="A guaranteed melee knockback attack which does 2-3 damage and disorients the target if activated in Defensive Stance. Activates Ebb and Flow. Can apply bonus weapon effects."
+LocPromotionPopupText="<Bullet/> Melee knockback attack which will disorient the target for 2 turns if activated in Defensive Stance. 3 turn cooldown.<br/><Bullet/> It is a guaranteed hit which does 2-3 damage. It can also apply bonus weapon effects.<br/><Bullet/> Parting Strike ability allows Half-Sword to shred armor and do +1 damage.<br/><Bullet/> Activates Ebb and Flow.<br/><Bullet/> This ability is available in both stances.<br/>"

[WardenLightningReflexes X2AbilityTemplate]
+LocFriendlyName="Lightning Reflexes"
+LocLongDescription="Each turn, the first Reaction shot against you misses."
+LocHelpText="Each turn, the first Reaction shot against you misses."
+LocPromotionPopupText="<Bullet/> Lightning Reflexes can be used to draw the Overwatch shots of enemies and protect squadmates.<br/>"

[WardenBladestorm X2AbilityTemplate]
+LocFriendlyName="Bladestorm"
+LocLongDescription="Free Sword attacks on any enemies that enter or attack from melee range."
+LocHelpText="Free Sword attacks on any enemies that enter or attack from melee range."
+LocFlyOverText="Bladestorm"
+LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Bladestorm will trigger if that enemy tries to attack the Warden.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Bladestorm will trigger when that enemy moves into melee range.<br/>"

[WardenBladestormAttack X2AbilityTemplate]
+LocFriendlyName="Bladestorm"
+LocLongDescription="Free Sword attacks on any enemies that enter or attack from melee range."
+LocHelpText="Free Sword attacks on any enemies that enter or attack from melee range."
+LocFlyOverText="Bladestorm"
+LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Bladestorm will trigger if that enemy tries to attack the Warden.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Bladestorm will trigger when that enemy moves into melee range.<br/>"

[WardenPremonition X2AbilityTemplate]
+LocFriendlyName="Premonition"
+LocLongDescription="Allows the Warden to change stances without attacking. Free action on a 3 turn cooldown. Activates Ebb and Flow."
+LocHelpText="Allows the Warden to change stances without attacking. Free action on a 3 turn cooldown."
+LocPromotionPopupText="<Bullet/> Mastery over Ebb and Flow. <br/><Bullet/> Allows the Warden to change stances without attacking and activates Ebb and Flow.<br/><Bullet/> It is a free action on a 3 turn cooldown.<br/><Bullet/> Enables interesting combos where the Warden can melee first and then shoot at point blank range, or prepare with a Defensive Stance ability before launching an attack.<br/><Bullet/> This ability is available in both stances.<br/><Bullet/> Can be activated while on fire or disoriented.<br/>"

[WardenWinding X2AbilityTemplate]
+LocFriendlyName="Winding"
+LocLongDescription="A twisting melee strike which deals critical damage and ensures that the target takes an additional +3 damage from all attacks in the future. Offensive Stance only and disables Warden's Advance during the same turn. Activates Ebb and Flow."
+LocHelpText="A twisting melee strike which deals critical damage and ensures that the target takes an additional +3 damage from all attacks in the future. Offensive Stance only. Activates Ebb and Flow"
+LocPromotionPopupText="<Bullet/> Winding deals guaranteed critical damage and applies Rupture if it hits.<br/><Bullet/> Ruptured targets take 3 additional damage from every attack. Has a 4 turn cooldown.<br/><Bullet/> Winding takes advantage of its own Rupture effect, it will always do +3 damage.<br/><Bullet/> While Winding is a guaranteed Crit it is not a guaranteed Hit.<br/><Bullet/> After activating Winding you cannot activate Warden's Advance during the same turn.<br/><Bullet/> Activates Ebb and Flow.<br/><Bullet/> Can only be activated in Offensive Stance.<br/>"

[WardenPush X2AbilityTemplate]
+LocFriendlyName="Warden's Tide"
+LocLongDescription="Push back all enemies around the Warden in a large area and stun them. Disorients if in Defensive Stance. Does 4-6 Damage ignoring cover and armor. Stuns for 1 Action Point. Has a 5 turn cooldown. Activates Ebb and Flow."
+LocHelpText="Push back all enemies around the Warden in a large area and stun them. Disorients if in Defensive Stance. Does 4-6 Damage ignoring cover and armor. Has a 5 turn cooldown. Activates Ebb and Flow."
+LocPromotionPopupText="<Bullet/> The Warden gathers all the psionic energy around the battlefield and releases to knock every enemy back, even if they are behind cover.<br/><Bullet/> Ignores friendly targets.<br/><Bullet/> Does not end your turn.<br/><Bullet/> Does 4-6 Damage ignoring cover and armor.<br/><Bullet/> Stuns for 1 Action Point. Disorients for 2 turns if in Defensive Stance. 5 turn cooldown.<br/><Bullet/> Does no environmental damage.<br/><Bullet/> This ability is available in both stances.<br/><Bullet/> Activates Ebb and Flow.<br/><Bullet/> Warden's Tide has great cover denial potential if you activate it in the middle of an enemy group.<br/>"

[WardenUnbalanceShot X2AbilityTemplate]
+LocFriendlyName="Unbalance"
+LocLongDescription="A succesful shot will cause the target to lose its balance. Target takes an additional 25% damage from all sources for the rest of the turn. Available in both stances. Does not end your turn. Costs 2 Ammo. 3 turn cooldown."
+LocHelpText="Causes the target to lose its balance. Imbalanced targets take an additional 25% damage from all sources for the rest of the turn."
+LocHitMessage="Imbalanced"
+LocPromotionPopupText="<Bullet/> Target takes an additional 25% damage from all sources for the rest of the turn.<br/><Bullet/> Does not end your turn.<br/><Bullet/> Costs 2 Ammo and has a 3 turn cooldown.<br/><Bullet/> Available in both stances<br/><Bullet/> Unbalance is the only ranged ability that is available in Defensive stance.<br/>"

[WardenBarrageUnlock X2SoldierAbilityUnlockTemplate]
+DisplayName="Warden: Barrage"
+Summary="Ranged attacks against flanked enemies deal +1 damage. All attacks have a bonus 5% chance to critically hit enemies."